# InsertProposedClassOrLayerItem

## Description
Inserts a class or layer item in the proposed section of a Class, Design Layer, or Sheet Layer Layout Manager Pull Down.

```pascal
FUNCTION InsertProposedClassOrLayerItem(
				nDialogID    : LONGINT;
				nComponentID : LONGINT;
				strLabel     : STRING;
				nIconIndex   : INTEGER) : BOOLEAN;
```

```python

def vs.InsertProposedClassOrLayerItem(nDialogID, nComponentID, strLabel, nIconIndex):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|strLabel|STRING||
|nIconIndex|INTEGER||

## Version
```diff
- InsertProposedClassOrLayerItem is obsolete as of Vectorworks 2012
```

Availability: from VectorWorks 2008
## Category
* Dialogs - Modern